MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4682/mcu.h
// Register: RXF12SIDL
#define RXF12SIDL RXF12SIDL
extern volatile unsigned char           RXF12SIDL           __at(0xD81);
#ifndef _LIB_BUILD
asm("RXF12SIDL equ 0D81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF12EID16             :1;
        unsigned RXF12EID17             :1;
        unsigned                        :1;
        unsigned RXF12EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF12SID0              :1;
        unsigned RXF12SID1              :1;
        unsigned RXF12SID2              :1;
    };
} RXF12SIDLbits_t;
extern volatile RXF12SIDLbits_t RXF12SIDLbits __at(0xD81);
// bitfield macros
#define _RXF12SIDL_EID16_POSN                               0x0
#define _RXF12SIDL_EID16_POSITION                           0x0
#define _RXF12SIDL_EID16_SIZE                               0x1
#define _RXF12SIDL_EID16_LENGTH                             0x1
#define _RXF12SIDL_EID16_MASK                               0x1
#define _RXF12SIDL_EID17_POSN                               0x1
#define _RXF12SIDL_EID17_POSITION                           0x1
#define _RXF12SIDL_EID17_SIZE                               0x1
#define _RXF12SIDL_EID17_LENGTH                             0x1
#define _RXF12SIDL_EID17_MASK                               0x2
#define _RXF12SIDL_EXIDEN_POSN                              0x3
#define _RXF12SIDL_EXIDEN_POSITION                          0x3
#define _RXF12SIDL_EXIDEN_SIZE                              0x1
#define _RXF12SIDL_EXIDEN_LENGTH                            0x1
#define _RXF12SIDL_EXIDEN_MASK                              0x8
#define _RXF12SIDL_SID0_POSN                                0x5
#define _RXF12SIDL_SID0_POSITION                            0x5
#define _RXF12SIDL_SID0_SIZE                                0x1
#define _RXF12SIDL_SID0_LENGTH                              0x1
#define _RXF12SIDL_SID0_MASK                                0x20
#define _RXF12SIDL_SID1_POSN                                0x6
#define _RXF12SIDL_SID1_POSITION                            0x6
#define _RXF12SIDL_SID1_SIZE                                0x1
#define _RXF12SIDL_SID1_LENGTH                              0x1
#define _RXF12SIDL_SID1_MASK                                0x40
#define _RXF12SIDL_SID2_POSN                                0x7
#define _RXF12SIDL_SID2_POSITION                            0x7
#define _RXF12SIDL_SID2_SIZE                                0x1
#define _RXF12SIDL_SID2_LENGTH                              0x1
#define _RXF12SIDL_SID2_MASK                                0x80
#define _RXF12SIDL_EXIDE_POSN                               0x3
#define _RXF12SIDL_EXIDE_POSITION                           0x3
#define _RXF12SIDL_EXIDE_SIZE                               0x1
#define _RXF12SIDL_EXIDE_LENGTH                             0x1
#define _RXF12SIDL_EXIDE_MASK                               0x8
#define _RXF12SIDL_RXF12EID16_POSN                          0x0
#define _RXF12SIDL_RXF12EID16_POSITION                      0x0
#define _RXF12SIDL_RXF12EID16_SIZE                          0x1
#define _RXF12SIDL_RXF12EID16_LENGTH                        0x1
#define _RXF12SIDL_RXF12EID16_MASK                          0x1
#define _RXF12SIDL_RXF12EID17_POSN                          0x1
#define _RXF12SIDL_RXF12EID17_POSITION                      0x1
#define _RXF12SIDL_RXF12EID17_SIZE                          0x1
#define _RXF12SIDL_RXF12EID17_LENGTH                        0x1
#define _RXF12SIDL_RXF12EID17_MASK                          0x2
#define _RXF12SIDL_RXF12EXIDEN_POSN                         0x3
#define _RXF12SIDL_RXF12EXIDEN_POSITION                     0x3
#define _RXF12SIDL_RXF12EXIDEN_SIZE                         0x1
#define _RXF12SIDL_RXF12EXIDEN_LENGTH                       0x1
#define _RXF12SIDL_RXF12EXIDEN_MASK                         0x8
#define _RXF12SIDL_RXF12SID0_POSN                           0x5
#define _RXF12SIDL_RXF12SID0_POSITION                       0x5
#define _RXF12SIDL_RXF12SID0_SIZE                           0x1
#define _RXF12SIDL_RXF12SID0_LENGTH                         0x1
#define _RXF12SIDL_RXF12SID0_MASK                           0x20
#define _RXF12SIDL_RXF12SID1_POSN                           0x6
#define _RXF12SIDL_RXF12SID1_POSITION                       0x6
#define _RXF12SIDL_RXF12SID1_SIZE                           0x1
#define _RXF12SIDL_RXF12SID1_LENGTH                         0x1
#define _RXF12SIDL_RXF12SID1_MASK                           0x40
#define _RXF12SIDL_RXF12SID2_POSN                           0x7
#define _RXF12SIDL_RXF12SID2_POSITION                       0x7
#define _RXF12SIDL_RXF12SID2_SIZE                           0x1
#define _RXF12SIDL_RXF12SID2_LENGTH                         0x1
#define _RXF12SIDL_RXF12SID2_MASK                           0x80

// Register: RXF12EIDH
#define RXF12EIDH RXF12EIDH
extern volatile unsigned char           RXF12EIDH           __at(0xD82);
#ifndef _LIB_BUILD
asm("RXF12EIDH equ 0D82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF12EID8              :1;
        unsigned RXF12EID9              :1;
        unsigned RXF12EID10             :1;
        unsigned RXF12EID11             :1;
        unsigned RXF12EID12             :1;
        unsigned RXF12EID13             :1;
        unsigned RXF12EID14             :1;
        unsigned RXF12EID15             :1;
    };
} RXF12EIDHbits_t;
extern volatile RXF12EIDHbits_t RXF12EIDHbits __at(0xD82);
// bitfield macros
#define _RXF12EIDH_EID8_POSN                                0x0
#define _RXF12EIDH_EID8_POSITION                            0x0
#define _RXF12EIDH_EID8_SIZE                                0x1
#define _RXF12EIDH_EID8_LENGTH                              0x1
#define _RXF12EIDH_EID8_MASK                                0x1
#define _RXF12EIDH_EID9_POSN                                0x1
#define _RXF12EIDH_EID9_POSITION                            0x1
#define _RXF12EIDH_EID9_SIZE                                0x1
#define _RXF12EIDH_EID9_LENGTH                              0x1
#define _RXF12EIDH_EID9_MASK                                0x2
#define _RXF12EIDH_EID10_POSN                               0x2
#define _RXF12EIDH_EID10_POSITION                           0x2
#define _RXF12EIDH_EID10_SIZE                               0x1
#define _RXF12EIDH_EID10_LENGTH                             0x1
#define _RXF12EIDH_EID10_MASK                               0x4
#define _RXF12EIDH_EID11_POSN                               0x3
#define _RXF12EIDH_EID11_POSITION                           0x3
#define _RXF12EIDH_EID11_SIZE                               0x1
#define _RXF12EIDH_EID11_LENGTH                             0x1
#define _RXF12EIDH_EID11_MASK                               0x8
#define _RXF12EIDH_EID12_POSN                               0x4
#define _RXF12EIDH_EID12_POSITION                           0x4
#define _RXF12EIDH_EID12_SIZE                               0x1
#define _RXF12EIDH_EID12_LENGTH                             0x1
#define _RXF12EIDH_EID12_MASK                               0x10
#define _RXF12EIDH_EID13_POSN                               0x5
#define _RXF12EIDH_EID13_POSITION                           0x5
#define _RXF12EIDH_EID13_SIZE                               0x1
#define _RXF12EIDH_EID13_LENGTH                             0x1
#define _RXF12EIDH_EID13_MASK                               0x20
#define _RXF12EIDH_EID14_POSN                               0x6
#define _RXF12EIDH_EID14_POSITION                           0x6
#define _RXF12EIDH_EID14_SIZE                               0x1
#define _RXF12EIDH_EID14_LENGTH                             0x1
#define _RXF12EIDH_EID14_MASK                               0x40
#define _RXF12EIDH_EID15_POSN                               0x7
#define _RXF12EIDH_EID15_POSITION                           0x7
#define _RXF12EIDH_EID15_SIZE                               0x1
#define _RXF12EIDH_EID15_LENGTH                             0x1
#define _RXF12EIDH_EID15_MASK                               0x80
#define _RXF12EIDH_RXF12EID8_POSN                           0x0
#define _RXF12EIDH_RXF12EID8_POSITION                       0x0
#define _RXF12EIDH_RXF12EID8_SIZE                           0x1
#define _RXF12EIDH_RXF12EID8_LENGTH                         0x1
#define _RXF12EIDH_RXF12EID8_MASK                           0x1
#define _RXF12EIDH_RXF12EID9_POSN                           0x1
#define _RXF12EIDH_RXF12EID9_POSITION                       0x1
#define _RXF12EIDH_RXF12EID9_SIZE                           0x1
#define _RXF12EIDH_RXF12EID9_LENGTH                         0x1
#define _RXF12EIDH_RXF12EID9_MASK                           0x2
#define _RXF12EIDH_RXF12EID10_POSN                          0x2
#define _RXF12EIDH_RXF12EID10_POSITION                      0x2
#define _RXF12EIDH_RXF12EID10_SIZE                          0x1
#define _RXF12EIDH_RXF12EID10_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID10_MASK                          0x4
#define _RXF12EIDH_RXF12EID11_POSN                          0x3
#define _RXF12EIDH_RXF12EID11_POSITION                      0x3
#define _RXF12EIDH_RXF12EID11_SIZE                          0x1
#define _RXF12EIDH_RXF12EID11_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID11_MASK                          0x8
#define _RXF12EIDH_RXF12EID12_POSN                          0x4
#define _RXF12EIDH_RXF12EID12_POSITION                      0x4
#define _RXF12EIDH_RXF12EID12_SIZE                          0x1
#define _RXF12EIDH_RXF12EID12_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID12_MASK                          0x10
#define _RXF12EIDH_RXF12EID13_POSN                          0x5
#define _RXF12EIDH_RXF12EID13_POSITION                      0x5
#define _RXF12EIDH_RXF12EID13_SIZE                          0x1
#define _RXF12EIDH_RXF12EID13_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID13_MASK                          0x20
#define _RXF12EIDH_RXF12EID14_POSN                          0x6
#define _RXF12EIDH_RXF12EID14_POSITION                      0x6
#define _RXF12EIDH_RXF12EID14_SIZE                          0x1
#define _RXF12EIDH_RXF12EID14_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID14_MASK                          0x40
#define _RXF12EIDH_RXF12EID15_POSN                          0x7
#define _RXF12EIDH_RXF12EID15_POSITION                      0x7
#define _RXF12EIDH_RXF12EID15_SIZE                          0x1
#define _RXF12EIDH_RXF12EID15_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID15_MASK                          0x80

// Register: RXF12EIDL
#define RXF12EIDL RXF12EIDL
extern volatile unsigned char           RXF12EIDL           __at(0xD83);
#ifndef _LIB_BUILD
asm("RXF12EIDL equ 0D83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF12EID0              :1;
        unsigned RXF12EID1              :1;
        unsigned RXF12EID2              :1;
        unsigned RXF12EID3              :1;
        unsigned RXF12EID4              :1;
        unsigned RXF12EID5              :1;
        unsigned RXF12EID6              :1;
        unsigned RXF12EID7              :1;
    };
} RXF12EIDLbits_t;
extern volatile RXF12EIDLbits_t RXF12EIDLbits __at(0xD83);
// bitfield macros
#define _RXF12EIDL_EID0_POSN                                0x0
#define _RXF12EIDL_EID0_POSITION                            0x0
#define _RXF12EIDL_EID0_SIZE                                0x1
#define _RXF12EIDL_EID0_LENGTH                              0x1
#define _RXF12EIDL_EID0_MASK                                0x1
#define _RXF12EIDL_EID1_POSN                                0x1
#define _RXF12EIDL_EID1_POSITION                            0x1
#define _RXF12EIDL_EID1_SIZE                                0x1
#define _RXF12EIDL_EID1_LENGTH                              0x1
#define _RXF12EIDL_EID1_MASK                                0x2
#define _RXF12EIDL_EID2_POSN                                0x2
#define _RXF12EIDL_EID2_POSITION                            0x2
#define _RXF12EIDL_EID2_SIZE                                0x1
#define _RXF12EIDL_EID2_LENGTH                              0x1
#define _RXF12EIDL_EID2_MASK                                0x4
#define _RXF12EIDL_EID3_POSN                                0x3
#define _RXF12EIDL_EID3_POSITION                            0x3
#define _RXF12EIDL_EID3_SIZE                                0x1
#define _RXF12EIDL_EID3_LENGTH                              0x1
#define _RXF12EIDL_EID3_MASK                                0x8
#define _RXF12EIDL_EID4_POSN                                0x4
#define _RXF12EIDL_EID4_POSITION                            0x4
#define _RXF12EIDL_EID4_SIZE                                0x1
#define _RXF12EIDL_EID4_LENGTH                              0x1
#define _RXF12EIDL_EID4_MASK                                0x10
#define _RXF12EIDL_EID5_POSN                                0x5
#define _RXF12EIDL_EID5_POSITION                            0x5
#define _RXF12EIDL_EID5_SIZE                                0x1
#define _RXF12EIDL_EID5_LENGTH                              0x1
#define _RXF12EIDL_EID5_MASK                                0x20
#define _RXF12EIDL_EID6_POSN                                0x6
#define _RXF12EIDL_EID6_POSITION                            0x6
#define _RXF12EIDL_EID6_SIZE                                0x1
#define _RXF12EIDL_EID6_LENGTH                              0x1
#define _RXF12EIDL_EID6_MASK                                0x40
#define _RXF12EIDL_EID7_POSN                                0x7
#define _RXF12EIDL_EID7_POSITION                            0x7
#define _RXF12EIDL_EID7_SIZE                                0x1
#define _RXF12EIDL_EID7_LENGTH                              0x1
#define _RXF12EIDL_EID7_MASK                                0x80
#define _RXF12EIDL_RXF12EID0_POSN                           0x0
#define _RXF12EIDL_RXF12EID0_POSITION                       0x0
#define _RXF12EIDL_RXF12EID0_SIZE                           0x1
#define _RXF12EIDL_RXF12EID0_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID0_MASK                           0x1
#define _RXF12EIDL_RXF12EID1_POSN                           0x1
#define _RXF12EIDL_RXF12EID1_POSITION                       0x1
#define _RXF12EIDL_RXF12EID1_SIZE                           0x1
#define _RXF12EIDL_RXF12EID1_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID1_MASK                           0x2
#define _RXF12EIDL_RXF12EID2_POSN                           0x2
#define _RXF12EIDL_RXF12EID2_POSITION                       0x2
#define _RXF12EIDL_RXF12EID2_SIZE                           0x1
#define _RXF12EIDL_RXF12EID2_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID2_MASK                           0x4
#define _RXF12EIDL_RXF12EID3_POSN                           0x3
#define _RXF12EIDL_RXF12EID3_POSITION                       0x3
#define _RXF12EIDL_RXF12EID3_SIZE                           0x1
#define _RXF12EIDL_RXF12EID3_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID3_MASK                           0x8
#define _RXF12EIDL_RXF12EID4_POSN                           0x4
#define _RXF12EIDL_RXF12EID4_POSITION                       0x4
#define _RXF12EIDL_RXF12EID4_SIZE                           0x1
#define _RXF12EIDL_RXF12EID4_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID4_MASK                           0x10
#define _RXF12EIDL_RXF12EID5_POSN                           0x5
#define _RXF12EIDL_RXF12EID5_POSITION                       0x5
#define _RXF12EIDL_RXF12EID5_SIZE                           0x1
#define _RXF12EIDL_RXF12EID5_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID5_MASK                           0x20
#define _RXF12EIDL_RXF12EID6_POSN                           0x6
#define _RXF12EIDL_RXF12EID6_POSITION                       0x6
#define _RXF12EIDL_RXF12EID6_SIZE                           0x1
#define _RXF12EIDL_RXF12EID6_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID6_MASK                           0x40
#define _RXF12EIDL_RXF12EID7_POSN                           0x7
#define _RXF12EIDL_RXF12EID7_POSITION                       0x7
#define _RXF12EIDL_RXF12EID7_SIZE                           0x1
#define _RXF12EIDL_RXF12EID7_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID7_MASK                           0x80

// Register: RXF13SIDH
#define RXF13SIDH RXF13SIDH
extern volatile unsigned char           RXF13SIDH           __at(0xD84);
#ifndef _LIB_BUILD
asm("RXF13SIDH equ 0D84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF13SID3              :1;
        unsigned RXF13SID4              :1;
        unsigned RXF13SID5              :1;
        unsigned RXF13SID6              :1;
        unsigned RXF13SID7              :1;
        unsigned RXF13SID8              :1;
        unsigned RXF13SID9              :1;
        unsigned RXF13SID10             :1;
    };
} RXF13SIDHbits_t;
extern volatile RXF13SIDHbits_t RXF13SIDHbits __at(0xD84);
// bitfield macros
#define _RXF13SIDH_SID3_POSN                                0x0
#define _RXF13SIDH_SID3_POSITION                            0x0
#define _RXF13SIDH_SID3_SIZE                                0x1
#define _RXF13SIDH_SID3_LENGTH                              0x1
#define _RXF13SIDH_SID3_MASK                                0x1
#define _RXF13SIDH_SID4_POSN                                0x1
#define _RXF13SIDH_SID4_POSITION                            0x1
#define _RXF13SIDH_SID4_SIZE                                0x1
#define _RXF13SIDH_SID4_LENGTH                              0x1
#define _RXF13SIDH_SID4_MASK                                0x2
#define _RXF13SIDH_SID5_POSN                                0x2
#define _RXF13SIDH_SID5_POSITION                            0x2
#define _RXF13SIDH_SID5_SIZE                                0x1
#define _RXF13SIDH_SID5_LENGTH                              0x1
#define _RXF13SIDH_SID5_MASK                                0x4
#define _RXF13SIDH_SID6_POSN                                0x3
#define _RXF13SIDH_SID6_POSITION                            0x3
#define _RXF13SIDH_SID6_SIZE                                0x1
#define _RXF13SIDH_SID6_LENGTH                              0x1
#define _RXF13SIDH_SID6_MASK                                0x8
#define _RXF13SIDH_SID7_POSN                                0x4
#define _RXF13SIDH_SID7_POSITION                            0x4
#define _RXF13SIDH_SID7_SIZE                                0x1
#define _RXF13SIDH_SID7_LENGTH                              0x1
#define _RXF13SIDH_SID7_MASK                                0x10
#define _RXF13SIDH_SID8_POSN                                0x5
#define _RXF13SIDH_SID8_POSITION                            0x5
#define _RXF13SIDH_SID8_SIZE                                0x1
#define _RXF13SIDH_SID8_LENGTH                              0x1
#define _RXF13SIDH_SID8_MASK                                0x20
#define _RXF13SIDH_SID9_POSN                                0x6
#define _RXF13SIDH_SID9_POSITION                            0x6
#define _RXF13SIDH_SID9_SIZE                                0x1
#define _RXF13SIDH_SID9_LENGTH                              0x1
#define _RXF13SIDH_SID9_MASK                                0x40
#define _RXF13SIDH_SID10_POSN                               0x7
#define _RXF13SIDH_SID10_POSITION                           0x7
#define _RXF13SIDH_SID10_SIZE                               0x1
#define _RXF13SIDH_SID10_LENGTH                             0x1
#define _RXF13SIDH_SID10_MASK                               0x80
#define _RXF13SIDH_RXF13SID3_POSN                           0x0
#define _RXF13SIDH_RXF13SID3_POSITION                       0x0
#define _RXF13SIDH_RXF13SID3_SIZE                           0x1
#define _RXF13SIDH_RXF13SID3_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID3_MASK                           0x1
#define _RXF13SIDH_RXF13SID4_POSN                           0x1
#define _RXF13SIDH_RXF13SID4_POSITION                       0x1
#define _RXF13SIDH_RXF13SID4_SIZE                           0x1
#define _RXF13SIDH_RXF13SID4_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID4_MASK                           0x2
#define _RXF13SIDH_RXF13SID5_POSN                           0x2
#define _RXF13SIDH_RXF13SID5_POSITION                       0x2
#define _RXF13SIDH_RXF13SID5_SIZE                           0x1
#define _RXF13SIDH_RXF13SID5_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID5_MASK                           0x4
#define _RXF13SIDH_RXF13SID6_POSN                           0x3
#define _RXF13SIDH_RXF13SID6_POSITION                       0x3
#define _RXF13SIDH_RXF13SID6_SIZE                           0x1
#define _RXF13SIDH_RXF13SID6_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID6_MASK                           0x8
#define _RXF13SIDH_RXF13SID7_POSN                           0x4
#define _RXF13SIDH_RXF13SID7_POSITION                       0x4
#define _RXF13SIDH_RXF13SID7_SIZE                           0x1
#define _RXF13SIDH_RXF13SID7_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID7_MASK                           0x10
#define _RXF13SIDH_RXF13SID8_POSN                           0x5
#define _RXF13SIDH_RXF13SID8_POSITION                       0x5
#define _RXF13SIDH_RXF13SID8_SIZE                           0x1
#define _RXF13SIDH_RXF13SID8_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID8_MASK                           0x20
#define _RXF13SIDH_RXF13SID9_POSN                           0x6
#define _RXF13SIDH_RXF13SID9_POSITION                       0x6
#define _RXF13SIDH_RXF13SID9_SIZE                           0x1
#define _RXF13SIDH_RXF13SID9_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID9_MASK                           0x40
#define _RXF13SIDH_RXF13SID10_POSN                          0x7
#define _RXF13SIDH_RXF13SID10_POSITION                      0x7
#define _RXF13SIDH_RXF13SID10_SIZE                          0x1
#define _RXF13SIDH_RXF13SID10_LENGTH                        0x1
#define _RXF13SIDH_RXF13SID10_MASK                          0x80

