MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4682/mcu.h
extern volatile B0SIDHbits_t B0SIDHbits __at(0xE21);
// bitfield macros
#define _B0SIDH_SID3_POSN                                   0x0
#define _B0SIDH_SID3_POSITION                               0x0
#define _B0SIDH_SID3_SIZE                                   0x1
#define _B0SIDH_SID3_LENGTH                                 0x1
#define _B0SIDH_SID3_MASK                                   0x1
#define _B0SIDH_SID4_POSN                                   0x1
#define _B0SIDH_SID4_POSITION                               0x1
#define _B0SIDH_SID4_SIZE                                   0x1
#define _B0SIDH_SID4_LENGTH                                 0x1
#define _B0SIDH_SID4_MASK                                   0x2
#define _B0SIDH_SID5_POSN                                   0x2
#define _B0SIDH_SID5_POSITION                               0x2
#define _B0SIDH_SID5_SIZE                                   0x1
#define _B0SIDH_SID5_LENGTH                                 0x1
#define _B0SIDH_SID5_MASK                                   0x4
#define _B0SIDH_SID6_POSN                                   0x3
#define _B0SIDH_SID6_POSITION                               0x3
#define _B0SIDH_SID6_SIZE                                   0x1
#define _B0SIDH_SID6_LENGTH                                 0x1
#define _B0SIDH_SID6_MASK                                   0x8
#define _B0SIDH_SID7_POSN                                   0x4
#define _B0SIDH_SID7_POSITION                               0x4
#define _B0SIDH_SID7_SIZE                                   0x1
#define _B0SIDH_SID7_LENGTH                                 0x1
#define _B0SIDH_SID7_MASK                                   0x10
#define _B0SIDH_SID8_POSN                                   0x5
#define _B0SIDH_SID8_POSITION                               0x5
#define _B0SIDH_SID8_SIZE                                   0x1
#define _B0SIDH_SID8_LENGTH                                 0x1
#define _B0SIDH_SID8_MASK                                   0x20
#define _B0SIDH_SID9_POSN                                   0x6
#define _B0SIDH_SID9_POSITION                               0x6
#define _B0SIDH_SID9_SIZE                                   0x1
#define _B0SIDH_SID9_LENGTH                                 0x1
#define _B0SIDH_SID9_MASK                                   0x40
#define _B0SIDH_SID10_POSN                                  0x7
#define _B0SIDH_SID10_POSITION                              0x7
#define _B0SIDH_SID10_SIZE                                  0x1
#define _B0SIDH_SID10_LENGTH                                0x1
#define _B0SIDH_SID10_MASK                                  0x80
#define _B0SIDH_B0SID3_POSN                                 0x0
#define _B0SIDH_B0SID3_POSITION                             0x0
#define _B0SIDH_B0SID3_SIZE                                 0x1
#define _B0SIDH_B0SID3_LENGTH                               0x1
#define _B0SIDH_B0SID3_MASK                                 0x1
#define _B0SIDH_B0SID4_POSN                                 0x1
#define _B0SIDH_B0SID4_POSITION                             0x1
#define _B0SIDH_B0SID4_SIZE                                 0x1
#define _B0SIDH_B0SID4_LENGTH                               0x1
#define _B0SIDH_B0SID4_MASK                                 0x2
#define _B0SIDH_B0SID5_POSN                                 0x2
#define _B0SIDH_B0SID5_POSITION                             0x2
#define _B0SIDH_B0SID5_SIZE                                 0x1
#define _B0SIDH_B0SID5_LENGTH                               0x1
#define _B0SIDH_B0SID5_MASK                                 0x4
#define _B0SIDH_B0SID6_POSN                                 0x3
#define _B0SIDH_B0SID6_POSITION                             0x3
#define _B0SIDH_B0SID6_SIZE                                 0x1
#define _B0SIDH_B0SID6_LENGTH                               0x1
#define _B0SIDH_B0SID6_MASK                                 0x8
#define _B0SIDH_B0SID7_POSN                                 0x4
#define _B0SIDH_B0SID7_POSITION                             0x4
#define _B0SIDH_B0SID7_SIZE                                 0x1
#define _B0SIDH_B0SID7_LENGTH                               0x1
#define _B0SIDH_B0SID7_MASK                                 0x10
#define _B0SIDH_B0SID8_POSN                                 0x5
#define _B0SIDH_B0SID8_POSITION                             0x5
#define _B0SIDH_B0SID8_SIZE                                 0x1
#define _B0SIDH_B0SID8_LENGTH                               0x1
#define _B0SIDH_B0SID8_MASK                                 0x20
#define _B0SIDH_B0SID9_POSN                                 0x6
#define _B0SIDH_B0SID9_POSITION                             0x6
#define _B0SIDH_B0SID9_SIZE                                 0x1
#define _B0SIDH_B0SID9_LENGTH                               0x1
#define _B0SIDH_B0SID9_MASK                                 0x40
#define _B0SIDH_B0SID10_POSN                                0x7
#define _B0SIDH_B0SID10_POSITION                            0x7
#define _B0SIDH_B0SID10_SIZE                                0x1
#define _B0SIDH_B0SID10_LENGTH                              0x1
#define _B0SIDH_B0SID10_MASK                                0x80

// Register: B0SIDL
#define B0SIDL B0SIDL
extern volatile unsigned char           B0SIDL              __at(0xE22);
#ifndef _LIB_BUILD
asm("B0SIDL equ 0E22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXID                   :1;
    };
    struct {
        unsigned B0EID16                :1;
        unsigned B0EID17                :1;
        unsigned                        :1;
        unsigned B0EXID                 :1;
        unsigned B0SRR                  :1;
        unsigned B0SID0                 :1;
        unsigned B0SID1                 :1;
        unsigned B0SID2                 :1;
    };
} B0SIDLbits_t;
extern volatile B0SIDLbits_t B0SIDLbits __at(0xE22);
// bitfield macros
#define _B0SIDL_EID16_POSN                                  0x0
#define _B0SIDL_EID16_POSITION                              0x0
#define _B0SIDL_EID16_SIZE                                  0x1
#define _B0SIDL_EID16_LENGTH                                0x1
#define _B0SIDL_EID16_MASK                                  0x1
#define _B0SIDL_EID17_POSN                                  0x1
#define _B0SIDL_EID17_POSITION                              0x1
#define _B0SIDL_EID17_SIZE                                  0x1
#define _B0SIDL_EID17_LENGTH                                0x1
#define _B0SIDL_EID17_MASK                                  0x2
#define _B0SIDL_EXIDE_POSN                                  0x3
#define _B0SIDL_EXIDE_POSITION                              0x3
#define _B0SIDL_EXIDE_SIZE                                  0x1
#define _B0SIDL_EXIDE_LENGTH                                0x1
#define _B0SIDL_EXIDE_MASK                                  0x8
#define _B0SIDL_SRR_POSN                                    0x4
#define _B0SIDL_SRR_POSITION                                0x4
#define _B0SIDL_SRR_SIZE                                    0x1
#define _B0SIDL_SRR_LENGTH                                  0x1
#define _B0SIDL_SRR_MASK                                    0x10
#define _B0SIDL_SID0_POSN                                   0x5
#define _B0SIDL_SID0_POSITION                               0x5
#define _B0SIDL_SID0_SIZE                                   0x1
#define _B0SIDL_SID0_LENGTH                                 0x1
#define _B0SIDL_SID0_MASK                                   0x20
#define _B0SIDL_SID1_POSN                                   0x6
#define _B0SIDL_SID1_POSITION                               0x6
#define _B0SIDL_SID1_SIZE                                   0x1
#define _B0SIDL_SID1_LENGTH                                 0x1
#define _B0SIDL_SID1_MASK                                   0x40
#define _B0SIDL_SID2_POSN                                   0x7
#define _B0SIDL_SID2_POSITION                               0x7
#define _B0SIDL_SID2_SIZE                                   0x1
#define _B0SIDL_SID2_LENGTH                                 0x1
#define _B0SIDL_SID2_MASK                                   0x80
#define _B0SIDL_EXID_POSN                                   0x3
#define _B0SIDL_EXID_POSITION                               0x3
#define _B0SIDL_EXID_SIZE                                   0x1
#define _B0SIDL_EXID_LENGTH                                 0x1
#define _B0SIDL_EXID_MASK                                   0x8
#define _B0SIDL_B0EID16_POSN                                0x0
#define _B0SIDL_B0EID16_POSITION                            0x0
#define _B0SIDL_B0EID16_SIZE                                0x1
#define _B0SIDL_B0EID16_LENGTH                              0x1
#define _B0SIDL_B0EID16_MASK                                0x1
#define _B0SIDL_B0EID17_POSN                                0x1
#define _B0SIDL_B0EID17_POSITION                            0x1
#define _B0SIDL_B0EID17_SIZE                                0x1
#define _B0SIDL_B0EID17_LENGTH                              0x1
#define _B0SIDL_B0EID17_MASK                                0x2
#define _B0SIDL_B0EXID_POSN                                 0x3
#define _B0SIDL_B0EXID_POSITION                             0x3
#define _B0SIDL_B0EXID_SIZE                                 0x1
#define _B0SIDL_B0EXID_LENGTH                               0x1
#define _B0SIDL_B0EXID_MASK                                 0x8
#define _B0SIDL_B0SRR_POSN                                  0x4
#define _B0SIDL_B0SRR_POSITION                              0x4
#define _B0SIDL_B0SRR_SIZE                                  0x1
#define _B0SIDL_B0SRR_LENGTH                                0x1
#define _B0SIDL_B0SRR_MASK                                  0x10
#define _B0SIDL_B0SID0_POSN                                 0x5
#define _B0SIDL_B0SID0_POSITION                             0x5
#define _B0SIDL_B0SID0_SIZE                                 0x1
#define _B0SIDL_B0SID0_LENGTH                               0x1
#define _B0SIDL_B0SID0_MASK                                 0x20
#define _B0SIDL_B0SID1_POSN                                 0x6
#define _B0SIDL_B0SID1_POSITION                             0x6
#define _B0SIDL_B0SID1_SIZE                                 0x1
#define _B0SIDL_B0SID1_LENGTH                               0x1
#define _B0SIDL_B0SID1_MASK                                 0x40
#define _B0SIDL_B0SID2_POSN                                 0x7
#define _B0SIDL_B0SID2_POSITION                             0x7
#define _B0SIDL_B0SID2_SIZE                                 0x1
#define _B0SIDL_B0SID2_LENGTH                               0x1
#define _B0SIDL_B0SID2_MASK                                 0x80

// Register: B0EIDH
#define B0EIDH B0EIDH
extern volatile unsigned char           B0EIDH              __at(0xE23);
#ifndef _LIB_BUILD
asm("B0EIDH equ 0E23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B0EID8                 :1;
        unsigned B0EID9                 :1;
        unsigned B0EID10                :1;
        unsigned B0EID11                :1;
        unsigned B0EID12                :1;
        unsigned B0EID13                :1;
        unsigned B0EID14                :1;
        unsigned B0EID15                :1;
    };
} B0EIDHbits_t;
extern volatile B0EIDHbits_t B0EIDHbits __at(0xE23);
// bitfield macros
#define _B0EIDH_EID8_POSN                                   0x0
#define _B0EIDH_EID8_POSITION                               0x0
#define _B0EIDH_EID8_SIZE                                   0x1
#define _B0EIDH_EID8_LENGTH                                 0x1
#define _B0EIDH_EID8_MASK                                   0x1
#define _B0EIDH_EID9_POSN                                   0x1
#define _B0EIDH_EID9_POSITION                               0x1
#define _B0EIDH_EID9_SIZE                                   0x1
#define _B0EIDH_EID9_LENGTH                                 0x1
#define _B0EIDH_EID9_MASK                                   0x2
#define _B0EIDH_EID10_POSN                                  0x2
#define _B0EIDH_EID10_POSITION                              0x2
#define _B0EIDH_EID10_SIZE                                  0x1
#define _B0EIDH_EID10_LENGTH                                0x1
#define _B0EIDH_EID10_MASK                                  0x4
#define _B0EIDH_EID11_POSN                                  0x3
#define _B0EIDH_EID11_POSITION                              0x3
#define _B0EIDH_EID11_SIZE                                  0x1
#define _B0EIDH_EID11_LENGTH                                0x1
#define _B0EIDH_EID11_MASK                                  0x8
#define _B0EIDH_EID12_POSN                                  0x4
#define _B0EIDH_EID12_POSITION                              0x4
#define _B0EIDH_EID12_SIZE                                  0x1
#define _B0EIDH_EID12_LENGTH                                0x1
#define _B0EIDH_EID12_MASK                                  0x10
#define _B0EIDH_EID13_POSN                                  0x5
#define _B0EIDH_EID13_POSITION                              0x5
#define _B0EIDH_EID13_SIZE                                  0x1
#define _B0EIDH_EID13_LENGTH                                0x1
#define _B0EIDH_EID13_MASK                                  0x20
#define _B0EIDH_EID14_POSN                                  0x6
#define _B0EIDH_EID14_POSITION                              0x6
#define _B0EIDH_EID14_SIZE                                  0x1
#define _B0EIDH_EID14_LENGTH                                0x1
#define _B0EIDH_EID14_MASK                                  0x40
#define _B0EIDH_EID15_POSN                                  0x7
#define _B0EIDH_EID15_POSITION                              0x7
#define _B0EIDH_EID15_SIZE                                  0x1
#define _B0EIDH_EID15_LENGTH                                0x1
#define _B0EIDH_EID15_MASK                                  0x80
#define _B0EIDH_B0EID8_POSN                                 0x0
#define _B0EIDH_B0EID8_POSITION                             0x0
#define _B0EIDH_B0EID8_SIZE                                 0x1
#define _B0EIDH_B0EID8_LENGTH                               0x1
#define _B0EIDH_B0EID8_MASK                                 0x1
#define _B0EIDH_B0EID9_POSN                                 0x1
#define _B0EIDH_B0EID9_POSITION                             0x1
#define _B0EIDH_B0EID9_SIZE                                 0x1
#define _B0EIDH_B0EID9_LENGTH                               0x1
#define _B0EIDH_B0EID9_MASK                                 0x2
#define _B0EIDH_B0EID10_POSN                                0x2
#define _B0EIDH_B0EID10_POSITION                            0x2
#define _B0EIDH_B0EID10_SIZE                                0x1
#define _B0EIDH_B0EID10_LENGTH                              0x1
#define _B0EIDH_B0EID10_MASK                                0x4
#define _B0EIDH_B0EID11_POSN                                0x3
#define _B0EIDH_B0EID11_POSITION                            0x3
#define _B0EIDH_B0EID11_SIZE                                0x1
#define _B0EIDH_B0EID11_LENGTH                              0x1
#define _B0EIDH_B0EID11_MASK                                0x8
#define _B0EIDH_B0EID12_POSN                                0x4
#define _B0EIDH_B0EID12_POSITION                            0x4
#define _B0EIDH_B0EID12_SIZE                                0x1
#define _B0EIDH_B0EID12_LENGTH                              0x1
#define _B0EIDH_B0EID12_MASK                                0x10
#define _B0EIDH_B0EID13_POSN                                0x5
#define _B0EIDH_B0EID13_POSITION                            0x5
#define _B0EIDH_B0EID13_SIZE                                0x1
#define _B0EIDH_B0EID13_LENGTH                              0x1
#define _B0EIDH_B0EID13_MASK                                0x20
#define _B0EIDH_B0EID14_POSN                                0x6
#define _B0EIDH_B0EID14_POSITION                            0x6
#define _B0EIDH_B0EID14_SIZE                                0x1
#define _B0EIDH_B0EID14_LENGTH                              0x1
#define _B0EIDH_B0EID14_MASK                                0x40
#define _B0EIDH_B0EID15_POSN                                0x7
#define _B0EIDH_B0EID15_POSITION                            0x7
#define _B0EIDH_B0EID15_SIZE                                0x1
#define _B0EIDH_B0EID15_LENGTH                              0x1
#define _B0EIDH_B0EID15_MASK                                0x80

// Register: B0EIDL
#define B0EIDL B0EIDL
extern volatile unsigned char           B0EIDL              __at(0xE24);
#ifndef _LIB_BUILD
asm("B0EIDL equ 0E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B0EID0                 :1;
        unsigned B0EID1                 :1;
        unsigned B0EID2                 :1;
        unsigned B0EID3                 :1;
        unsigned B0EID4                 :1;
        unsigned B0EID5                 :1;
        unsigned B0EID6                 :1;
        unsigned B0EID7                 :1;
    };
} B0EIDLbits_t;
extern volatile B0EIDLbits_t B0EIDLbits __at(0xE24);
// bitfield macros
#define _B0EIDL_EID0_POSN                                   0x0
#define _B0EIDL_EID0_POSITION                               0x0
#define _B0EIDL_EID0_SIZE                                   0x1
#define _B0EIDL_EID0_LENGTH                                 0x1
#define _B0EIDL_EID0_MASK                                   0x1
#define _B0EIDL_EID1_POSN                                   0x1
#define _B0EIDL_EID1_POSITION                               0x1
#define _B0EIDL_EID1_SIZE                                   0x1
#define _B0EIDL_EID1_LENGTH                                 0x1
#define _B0EIDL_EID1_MASK                                   0x2
#define _B0EIDL_EID2_POSN                                   0x2
#define _B0EIDL_EID2_POSITION                               0x2
#define _B0EIDL_EID2_SIZE                                   0x1
#define _B0EIDL_EID2_LENGTH                                 0x1
#define _B0EIDL_EID2_MASK                                   0x4
#define _B0EIDL_EID3_POSN                                   0x3
#define _B0EIDL_EID3_POSITION                               0x3
#define _B0EIDL_EID3_SIZE                                   0x1
#define _B0EIDL_EID3_LENGTH                                 0x1
#define _B0EIDL_EID3_MASK                                   0x8
#define _B0EIDL_EID4_POSN                                   0x4
#define _B0EIDL_EID4_POSITION                               0x4
#define _B0EIDL_EID4_SIZE                                   0x1
#define _B0EIDL_EID4_LENGTH                                 0x1
#define _B0EIDL_EID4_MASK                                   0x10
#define _B0EIDL_EID5_POSN                                   0x5
#define _B0EIDL_EID5_POSITION                               0x5
#define _B0EIDL_EID5_SIZE                                   0x1
#define _B0EIDL_EID5_LENGTH                                 0x1
#define _B0EIDL_EID5_MASK                                   0x20
#define _B0EIDL_EID6_POSN                                   0x6
#define _B0EIDL_EID6_POSITION                               0x6
#define _B0EIDL_EID6_SIZE                                   0x1
#define _B0EIDL_EID6_LENGTH                                 0x1
#define _B0EIDL_EID6_MASK                                   0x40
#define _B0EIDL_EID7_POSN                                   0x7
#define _B0EIDL_EID7_POSITION                               0x7
#define _B0EIDL_EID7_SIZE                                   0x1
#define _B0EIDL_EID7_LENGTH                                 0x1
#define _B0EIDL_EID7_MASK                                   0x80
#define _B0EIDL_B0EID0_POSN                                 0x0
#define _B0EIDL_B0EID0_POSITION                             0x0
#define _B0EIDL_B0EID0_SIZE                                 0x1
#define _B0EIDL_B0EID0_LENGTH                               0x1
#define _B0EIDL_B0EID0_MASK                                 0x1
#define _B0EIDL_B0EID1_POSN                                 0x1
#define _B0EIDL_B0EID1_POSITION                             0x1
#define _B0EIDL_B0EID1_SIZE                                 0x1
#define _B0EIDL_B0EID1_LENGTH                               0x1
#define _B0EIDL_B0EID1_MASK                                 0x2
#define _B0EIDL_B0EID2_POSN                                 0x2
#define _B0EIDL_B0EID2_POSITION                             0x2
#define _B0EIDL_B0EID2_SIZE                                 0x1
#define _B0EIDL_B0EID2_LENGTH                               0x1
#define _B0EIDL_B0EID2_MASK                                 0x4
#define _B0EIDL_B0EID3_POSN                                 0x3
#define _B0EIDL_B0EID3_POSITION                             0x3
#define _B0EIDL_B0EID3_SIZE                                 0x1
#define _B0EIDL_B0EID3_LENGTH                               0x1
#define _B0EIDL_B0EID3_MASK                                 0x8
#define _B0EIDL_B0EID4_POSN                                 0x4
#define _B0EIDL_B0EID4_POSITION                             0x4
#define _B0EIDL_B0EID4_SIZE                                 0x1
#define _B0EIDL_B0EID4_LENGTH                               0x1
#define _B0EIDL_B0EID4_MASK                                 0x10
#define _B0EIDL_B0EID5_POSN                                 0x5
#define _B0EIDL_B0EID5_POSITION                             0x5
#define _B0EIDL_B0EID5_SIZE                                 0x1
#define _B0EIDL_B0EID5_LENGTH                               0x1
#define _B0EIDL_B0EID5_MASK                                 0x20
#define _B0EIDL_B0EID6_POSN                                 0x6
#define _B0EIDL_B0EID6_POSITION                             0x6
#define _B0EIDL_B0EID6_SIZE                                 0x1
#define _B0EIDL_B0EID6_LENGTH                               0x1
#define _B0EIDL_B0EID6_MASK                                 0x40
#define _B0EIDL_B0EID7_POSN                                 0x7
#define _B0EIDL_B0EID7_POSITION                             0x7
#define _B0EIDL_B0EID7_SIZE                                 0x1
#define _B0EIDL_B0EID7_LENGTH                               0x1
#define _B0EIDL_B0EID7_MASK                                 0x80

